W4D1/library/app/controllers/books_controller.rb

  def create
    book = Book.create(book_params)
---
INSERT INTO "books" ("title", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Harry Potter and the Order of the Phoenix"], ["author", "J.K. Rowling"], ["created_at", "2016-07-27 17:04:33.390634"], ["updated_at", "2016-07-27 17:04:33.390634"]]